In [169]:
# Importing necessary libraries
import pandas as pd
import numpy as np

In [170]:
# Reading Titanic dataset (replace path with your own if needed)
# Recommended: Use relative path or upload file to avoid hardcoding local path
data=pd.read_csv(r"C:\Users\GURU PRAVEEN REDDY J\Desktop\Datasets\Titanic Dataset.csv")

In [171]:
# Displaying first 5 rows of the dataset
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Titanic dataset columns info

| Variable   | Definition                                      | Key                                              |
|------------|-------------------------------------------------|--------------------------------------------------|
| survival   | Survival                                        | 0 = No, 1 = Yes                                  |
| pclass     | Ticket class                                    | 1 = 1st, 2 = 2nd, 3 = 3rd                        |
| sex        | Sex                                             |                                                  |
| Age        | Age in years                                    |                                                  |
| sibsp      | # of siblings / spouses aboard the Titanic      |                                                  |
| parch      | # of parents / children aboard the Titanic      |                                                  |
| ticket     | Ticket number                                   |                                                  |
| fare       | Passenger fare                                  |                                                  |
| cabin      | Cabin number                                    |                                                  |
| embarked   | Port of Embarkation                             | C = Cherbourg, Q = Queenstown, S = Southampton   |

In [172]:
# Display dataset structure and data types
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [173]:
data=data[["PassengerId","Name","Sex","Age","Ticket","Fare","Embarked","Pclass","Cabin","SibSp","Parch","Survived"]]

In [175]:
data.isnull().sum()

PassengerId      0
Name             0
Sex              0
Age            177
Ticket           0
Fare             0
Embarked         2
Pclass           0
Cabin          687
SibSp            0
Parch            0
Survived         0
dtype: int64

In [176]:
data.drop(columns=["Cabin","Ticket"],inplace=True)
 # Cabin has more than 50% Nan values and also cabin details not much important and dropping the cabin column
# Ticket details also we dont need to analyse the data

In [177]:
data[data["PassengerId"].duplicated()]

Empty DataFrame
Columns: [PassengerId, Name, Sex, Age, Fare, Embarked, Pclass, SibSp, Parch, Survived]
Index: []

In [178]:
### NO duplicates in the passenger ID

In [179]:
data["Survived"].unique()

array([0, 1])

In [180]:
### ONlY TWO VALUES 0-MEANS FALSE WHICH MEANS NOT SURVIVED, AND 1-SURVIVED

In [181]:
data["Pclass"].unique() # only 3 classes

array([3, 1, 2])

In [182]:
data["Sex"].unique()

array(['male', 'female'], dtype=object)

In [183]:
### In age column we have 177 null values only one way to clean the dataset is by droping the rows which have age as null or replace by mean or median
### we have only 891 rows its better to replace the data based on the title of the name and replacing null values with the median based on the title

In [184]:
data['Title'] = data['Name'].str.extract('([A-Za-z]+)\.',expand=False)

<>:1: SyntaxWarning: invalid escape sequence '\.'
<>:1: SyntaxWarning: invalid escape sequence '\.'
C:\Users\GURU PRAVEEN REDDY J\AppData\Local\Temp\ipykernel_26600\1653271408.py:1: SyntaxWarning: invalid escape sequence '\.'
  data['Title'] = data['Name'].str.extract('([A-Za-z]+)\.',expand=False)

In [185]:
data["Title"].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms',
       'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt', 'Countess',
       'Jonkheer'], dtype=object)

In [186]:
title_map = {
    'Mlle': 'Miss', 'Ms': 'Miss', 'Mme': 'Mrs', 'Lady': 'Royalty',
    'Countess': 'Royalty', 'Capt': 'Officer', 'Col': 'Officer',
    'Major': 'Officer', 'Dr': 'Officer', 'Rev': 'Officer', 'Sir': 'Royalty',
    'Don': 'Royalty', 'Jonkheer': 'Royalty', 'Dona': 'Royalty'}

In [187]:
data['Title'] = data['Title'].replace(title_map)

In [188]:
# Impute Age by median of Title
data['Age'] = data.groupby('Title')['Age'].transform(lambda x: x.fillna(x.median()))

In [189]:
data

,PassengerId,Name,Sex,Age,Fare,Embarked,Pclass,SibSp,Parch,Survived,Title
0,1,"Braund, Mr. Owen Harris",male,22.0,7.2500,S,3,1,0,0,Mr
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,C,1,1,0,1,Mrs
2,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,S,3,0,0,1,Miss
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,S,1,1,0,1,Mrs
4,5,"Allen, Mr. William Henry",male,35.0,8.0500,S,3,0,0,0,Mr
...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0,13.0000,S,2,0,0,0,Officer
887,888,"Graham, Miss. Margaret Edith",female,19.0,30.0000,S,1,0,0,1,Miss
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,21.0,23.4500,S,3,1,2,0,Miss
889,890,"Behr, Mr. Karl Howell",male,26.0,30.0000,C,1,0,0,1,Mr
890,891,"Dooley, Mr. Patrick",male,32.0,7.7500,Q,3,0,0,0,Mr

In [190]:
data.isnull().sum()

PassengerId    0
Name           0
Sex            0
Age            0
Fare           0
Embarked       2
Pclass         0
SibSp          0
Parch          0
Survived       0
Title          0
dtype: int64

In [191]:
data.dropna(inplace=True)

In [192]:
data.isnull().sum()

PassengerId    0
Name           0
Sex            0
Age            0
Fare           0
Embarked       0
Pclass         0
SibSp          0
Parch          0
Survived       0
Title          0
dtype: int64

In [193]:
data.reset_index()

,index,PassengerId,Name,Sex,Age,Fare,Embarked,Pclass,SibSp,Parch,Survived,Title
0,0,1,"Braund, Mr. Owen Harris",male,22.0,7.2500,S,3,1,0,0,Mr
1,1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,C,1,1,0,1,Mrs
2,2,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,S,3,0,0,1,Miss
3,3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,S,1,1,0,1,Mrs
4,4,5,"Allen, Mr. William Henry",male,35.0,8.0500,S,3,0,0,0,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...
884,886,887,"Montvila, Rev. Juozas",male,27.0,13.0000,S,2,0,0,0,Officer
885,887,888,"Graham, Miss. Margaret Edith",female,19.0,30.0000,S,1,0,0,1,Miss
886,888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,21.0,23.4500,S,3,1,2,0,Miss
887,889,890,"Behr, Mr. Karl Howell",male,26.0,30.0000,C,1,0,0,1,Mr
888,890,891,"Dooley, Mr. Patrick",male,32.0,7.7500,Q,3,0,0,0,Mr

In [194]:
data["Age"].astype("int")

0      22
1      38
2      26
3      35
4      35
       ..
886    27
887    19
888    21
889    26
890    32
Name: Age, Length: 889, dtype: int64

In [196]:
data.to_csv(r"C:\Users\GURU PRAVEEN REDDY J\Desktop\Datasets\Titanic Dataset_EDA.csv")

## This cleaned data we can analyse in POWRBI